# Selecting one Column

In [16]:
import pandas as pd

In [17]:
# Reading the CSV File
df_exam = pd.read_csv("StudentsPerformance.csv")

In [18]:
df_exam.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

## Syntax 1

In [19]:
# Select a column with [] (Preferred way to select a column)
df_exam["gender"]

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [20]:
# Checking the data type of a column
type(df_exam["gender"])

pandas.core.series.Series

In [21]:
# Series: attrihute and methods
df_exam["gender"].index

RangeIndex(start=0, stop=1000, step=1)

In [22]:
# TO get the first 5 
df_exam["gender"].head()

0    female
1    female
2    female
3      male
4      male
Name: gender, dtype: object

## Syntax 2

In [23]:
# Select a column with .
df_exam.gender

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [24]:
df_exam.lunch

0          standard
1          standard
2          standard
3      free/reduced
4          standard
           ...
995        standard
996    free/reduced
997    free/reduced
998        standard
999    free/reduced
Name: lunch, Length: 1000, dtype: object

In [25]:
# Select the same coulmn using []
df_exam["math score"]

0      72
1      69
2      90
3      47
4      76
       ..
995    88
996    62
997    59
998    68
999    77
Name: math score, Length: 1000, dtype: int64